{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting implemented features with file mappings, components, test IDs, and confidence levels for the GigMarket landing website.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files describing components, pages, routing, styling, and data structures.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes, including trust colors (blue and green).",
  "frontend/index.html": "HTML entry point for the GigMarket landing website with root div and module script reference.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with six routes (landing, about, manual, reviews, complaints, download) wrapped in a Layout component with Header and Footer.",
  "frontend/src/components/CTAFooter.tsx": "Call-to-action footer section with gradient background, compelling copy, and two CTA buttons linking to download and about pages.",
  "frontend/src/components/FeaturesSection.tsx": "Features showcase section displaying five key platform capabilities (verified workers, location-based hiring, quick hiring, ratings & reviews, multi-category workers) in a responsive card grid.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, quick links, support links, contact information, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Navigation header component with logo, desktop/mobile menus, and links to Home, About, Manual, Reviews, and Download pages. Includes responsive mobile menu toggle with hamburger icon.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with headline, description, CTA buttons (Download APK, Get Started), and a hero image with decorative gradient elements.",
  "frontend/src/components/HowItWorksSection.tsx": "Four-step process section explaining how to use the platform: post job, workers apply, hire instantly, and track status. Displays steps in card grid with icons.",
  "frontend/src/components/NavigationCards.tsx": "Grid of five navigation cards linking to About, User Manual, Reviews, Complaints, and Download pages. Each card has an icon, title, description, and gradient color scheme.",
  "frontend/src/components/StatsSection.tsx": "Statistics showcase section displaying four key metrics: 15,000+ workers, 25,000+ jobs, 4.8/5 rating, and 50+ cities. Features gradient background and icon-based layout.",
  "frontend/src/components/TestimonialsSection.tsx": "User testimonials section displaying four reviews from employers and workers with avatars, ratings, roles, and quoted feedback in a card grid layout.",
  "frontend/src/components/TrustBadgesSection.tsx": "Trust indicators section showing three badge images (Verified Platform, Secure Payments, Quality Service) with titles in a centered horizontal layout.",
  "frontend/src/components/WorkerCategoriesGrid.tsx": "Grid displaying seven worker categories (Factory, School, Construction, Helpers, Drivers, Cleaners, Technicians) with icons, names, and descriptions in hoverable cards.",
  "frontend/src/data/dummyData.ts": "Contains mock data arrays for FAQs, user reviews (employers and workers), and complaint tickets with various statuses and responses.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using React Query, handling both authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining trust-blue and trust-green brand colors and design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AboutApplicationPage.tsx": "Displays GigMarket's mission, problem statement, target users (workers and employers), and key features in a card-based layout.",
  "frontend/src/pages/ComplaintBoxPage.tsx": "Complaint submission form and tracking interface with category selection, status badges, and a list of existing complaints with their resolution states.",
  "frontend/src/pages/DownloadAPKPage.tsx": "Page component for downloading the GigMarket Android APK, featuring version info (v2.1.0), download button, app screenshots carousel, installation instructions, and system requirements.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page component that composes multiple sections (Hero, HowItWorks, Features, Stats, WorkerCategories, Navigation, TrustBadges, Testimonials, CTAFooter) into a single scrollable page.",
  "frontend/src/pages/ReviewCentrePage.tsx": "Review management page displaying overall ratings, rating distribution chart, filterable review list (by worker/employer), and a form for submitting new reviews with star ratings.",
  "frontend/src/pages/UserManualPage.tsx": "Comprehensive user guide page with step-by-step instructions for account creation, job posting, worker application, hiring process, safety tips, and FAQ accordion section.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including trust-blue/trust-green brand colors, OKLCH color system, custom shadows, Inter font family, and accordion animations.",
  "project_state.json": "Project metadata file documenting GigMarket as a worker hiring platform with architectural notes on mobile-first design, routing structure, trust-focused UI, and detailed image requirements for icons and illustrations."
}